app/controllers/voters_controller.rb

SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @voter = Voter.find(params[:id])